AoA_0/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
=========                |
\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
 \    /   O peration     | Website:  https://openfoam.org
  \  /    A nd           | Version:  12
   \/     M anipulation  |
\*---------------------------------------------------------------------------*/

/*-----------Angle of Attack: 0 degrees----------- */

//c 1; //tamaño de cuerda
//e_max 0.012; //espesor máximo

canard_1
{
    type            forceCoeffs;
    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         ("avion");

    rho             rhoInf;
    rhoInf          0.900172;

        liftDir         (0 1.000000 0);
        dragDir         (1.000000 0 0);
    pitchAxis       (0 0 -1);    //znegativo

    lRef            0.61;

    Aref            2.6680;

    CofR            (0 0 0);

    magUInf         18;
}

canard_2
{
    type            forceCoeffs;
    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         ("avion");

    rho             rhoInf;
    rhoInf          0.900172;

        liftDir         (0 1.000000 0);
        dragDir         (1.000000 0 0);
    pitchAxis       (0 0 -1);    //znegativo

    lRef            0.61;

    Aref            2.6680;

    CofR            (0.16 0 0);

    magUInf         18;
}

canard_3
{
    type            forceCoeffs;
    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         ("avion");

    rho             rhoInf;
    rhoInf          0.900172;

        liftDir         (0 1.000000 0);
        dragDir         (1.000000 0 0);
    pitchAxis       (0 0 -1);    //znegativo

    lRef            0.61;

    Aref            2.6680;

    CofR            (0.32 0 0);

    magUInf         18;
}

canard_4
{
    type            forceCoeffs;
    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         ("avion");

    rho             rhoInf;
    rhoInf          0.900172;

        liftDir         (0 1.000000 0);
        dragDir         (1.000000 0 0);
    pitchAxis       (0 0 -1);    //znegativo

    lRef            0.61;

    Aref            2.6680;

    CofR            (0.48 0 0);

    magUInf         18;
}

canard_5
{
    type            forceCoeffs;
    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         ("avion");

    rho             rhoInf;
    rhoInf          0.900172;

        liftDir         (0 1.000000 0);
        dragDir         (1.000000 0 0);
    pitchAxis       (0 0 -1);    //znegativo

    lRef            0.61;

    Aref            2.6680;

    CofR            (0.64 0 0);

    magUInf         18;
}

canard_6
{
    type            forceCoeffs;
    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         ("avion");

    rho             rhoInf;
    rhoInf          0.900172;

        liftDir         (0 1.000000 0);
        dragDir         (1.000000 0 0);
    pitchAxis       (0 0 -1);    //znegativo

    lRef            0.61;

    Aref            2.6680;

    CofR            (0.80 0 0);

    magUInf         18;
}

canard_7
{
    type            forceCoeffs;
    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         ("avion");

    rho             rhoInf;
    rhoInf          0.900172;

        liftDir         (0 1.000000 0);
        dragDir         (1.000000 0 0);
    pitchAxis       (0 0 -1);    //znegativo

    lRef            0.61;

    Aref            2.6680;

    CofR            (0.96 0 0);

    magUInf         18;
}

canard_8
{
    type            forceCoeffs;
    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         ("avion");

    rho             rhoInf;
    rhoInf          0.900172;

        liftDir         (0 1.000000 0);
        dragDir         (1.000000 0 0);
    pitchAxis       (0 0 -1);    //znegativo

    lRef            0.61;

    Aref            2.6680;

    CofR            (1.12 0 0);

    magUInf         18;
}

canard_9
{
    type            forceCoeffs;
    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         ("avion");

    rho             rhoInf;
    rhoInf          0.900172;

        liftDir         (0 1.000000 0);
        dragDir         (1.000000 0 0);
    pitchAxis       (0 0 -1);    //znegativo

    lRef            0.61;

    Aref            2.6680;

    CofR            (1.28 0 0);

    magUInf         18;
}

canard_10
{
    type            forceCoeffs;
    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         ("avion");

    rho             rhoInf;
    rhoInf          0.900172;

            liftDir         (0 1.000000 0);
            dragDir         (1.000000 0 0);
    pitchAxis       (0 0 -1);    //znegativo

    lRef            0.61;

    Aref            2.6680;

    CofR            (1.44 0 0);

    magUInf         18;
}

canard_11
{
    type            forceCoeffs;
    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         ("avion");

    rho             rhoInf;
    rhoInf          0.900172;

            liftDir         (0 1.000000 0);
            dragDir         (1.000000 0 0);
    pitchAxis       (0 0 -1);    //znegativo

    lRef            0.61;

    Aref            2.6680;

    CofR            (1.60 0 0);

    magUInf         18;
}